[
    {
        "name": "Season One",
        "desc": "John Nolan is a man in his 40s, recently divorced, with a son in college and a construction business. After a harrowing experience during a bank robbery, he decides to become a cop, and as the LAPD is one of the few forces to accept officers his age, he packs up his belongings and moves to Los Angeles. We pick up his story just after he's graduated from the police academy when he's been assigned to the Mid-Wilshire division along with two other rookies.",
        "poster": "https://static1.srcdn.com/wordpress/wp-content/uploads/trailers/episode_poster/185643_Season%201.jpg",
        "location": "seasons/one",
        "cast": "Nathan Fillion, Alyssa Diaz, Richard T. Jones, Titus Makin, Mercedes Mason, Melissa O'Neil, Afton Williamson, Eric Winter",
        "episodes": [
            { "epno": 1, "title": "Pilot", "desc": "Starting over isn't easy, especially for John Nolan who, after a life-altering incident, is pursuing his dream of joining the LAPD." },
            { "epno": 2, "title": "Crash Course", "desc": "Talia forces Nolan to confront his personal moral instincts in order to be a good cop after he encounters a kidnapping victim." },
            { "epno": 3, "title": "The Good, the Bad and the Ugly", "desc": "After Nolan and Talia lose control of a crime scene, they begin to debate whether people are fundamentally good or bad." },
            { "epno": 4, "title": "The Switch", "desc": "The rookies are temporarily paired with new training officers, and Officer Nolan is paired with Officer Lopez." },
            { "epno": 5, "title": "The Roundup", "desc": "Nolan, the rookies, and their training officers get involved in a competition that pits them against each other." },
            { "epno": 6, "title": "The Hawke", "desc": "The team must help capture a cop and his former mentor from the academy after he becomes a fugitive following an assault." },
            { "epno": 7, "title": "The Ride Along", "desc": "Nolan and Bishop's ride-along goes awry when they find themselves in the middle of a bank robbery." },
            { "epno": 8, "title": "Time of Death", "desc": "Nolan and Bishop respond to a silent alarm call at a local convenience store where a robbery is in progress." },
            { "epno": 9, "title": "Standoff", "desc": "A man from Nolan's past causes complications for him and Lopez, while Bishop helps coordinate a drug bust." },
            { "epno": 10, "title": "Flesh and Blood", "desc": "Nolan tries to navigate his relationship with his son, Henry, when he comes to visit." },
            { "epno": 11, "title": "Redwood", "desc": "An unscheduled visit by the vice president of the United States puts the station on high alert." },
            { "epno": 12, "title": "Heartbreak", "desc": "The team is on high alert during Valentine's Day, and Nolan invites everyone over for a party now that he is single." },
            { "epno": 13, "title": "Caught Stealing", "desc": "The rookies become the prime suspects after it is discovered a large sum of money used in a drug bust has gone missing." },
            { "epno": 14, "title": "Plain Clothes Day", "desc": "The rookies are really put to the test when they are forced to make all decisions in the field without the guidance of their training officers." },
            { "epno": 15, "title": "Manhunt", "desc": "When a prison bus crashes, the team must search for a group of escaped convicts." },
            { "epno": 16, "title": "Green Light", "desc": "Nolan and Bishop respond to a murder scene in which they discover the victim was killed by a deadly new designer drug." },
            { "epno": 17, "title": "The Shake Up", "desc": "A massive earthquake rocks the city and throws everyone's patrols and personal lives into chaos." },
            { "epno": 18, "title": "Homefront", "desc": "When one of their own is involved in a shooting, the team must deal with the emotional fallout." },
            { "epno": 19, "title": "The Checklist", "desc": "The rookies are tasked with completing a list of final tasks as their training officers evaluate whether they are ready to become full-fledged officers." },
            { "epno": 20, "title": "Free Fall", "desc": "As the rookies prepare for a big exam to decide who moves forward in the training program, an attack on the city leaves everyone scrambling." }
        ]
    },
    {
        "name": "Season Two",
        "desc": "As of the first episode of season two, all three rookies have passed the exam, some with better scores than others. The season introduces Nyla Harper, who becomes John Nolan's new T.O. At the end of season two, the rookies were entering their final month of training, during which they were warned of more pressure and scrutiny than ever before.",
        "poster": "https://static1.srcdn.com/wordpress/wp-content/uploads/trailers/episode_poster/185643_Season%202.jpg",
        "location": "seasons/two",
        "cast": "Nathan Fillion, Alyssa Diaz, Richard T. Jones, Titus Makin, Melissa O'Neil, Mekia Cox, Eric Winter",
        "episodes": [
        { "epno": 1, "title": "Impact", "desc": "The rookies face the aftermath of a severe accident involving Officer Bradford. Nolan begins his training with new TO Nyla Harper, who has recently returned from undercover work." },
        { "epno": 2, "title": "The Night General", "desc": "Nolan works with Harper on a case involving a murder at a convenience store, while Jackson and Lopez investigate a series of robberies targeting pharmacies." },
        { "epno": 3, "title": "The Bet", "desc": "Harper puts Nolan through a grueling training session while the team investigates a case of stolen goods leading to a black market operation." },
        { "epno": 4, "title": "Warriors and Guardians", "desc": "Nolan and Harper debate the role of police officers as warriors or guardians while investigating a break-in at a community center." },
        { "epno": 5, "title": "Tough Love", "desc": "Harper teaches Nolan the importance of setting boundaries as they deal with a domestic dispute that escalates into a hostage situation." },
        { "epno": 6, "title": "Fallout", "desc": "An emergency alert of an impending missile attack sends Los Angeles into chaos, and the officers must try to maintain order amidst the panic." },
        { "epno": 7, "title": "Safety", "desc": "Nolan and Harper investigate a murder connected to a dangerous criminal organization, putting their lives at risk." },
        { "epno": 8, "title": "Clean Cut", "desc": "Nolan and Harper find themselves in a moral dilemma during a routine traffic stop, while the rest of the team handles a deadly armed robbery." },
        { "epno": 9, "title": "Breaking Point", "desc": "The team investigates a murder that exposes corruption within the department, forcing Nolan to question who he can trust." },
        { "epno": 10, "title": "The Dark Side", "desc": "Nolan and Harper escort a dangerous criminal during a storm, but their journey takes an unexpected and perilous turn." },
        { "epno": 11, "title": "Day of Death", "desc": "After a rookie goes missing, the team scrambles to find them before it’s too late, while Nolan faces his toughest decision yet." },
        { "epno": 12, "title": "Now and Then", "desc": "Nolan reconnects with an old friend while the team works to solve a kidnapping case involving a high-profile family." },
        { "epno": 13, "title": "Follow-Up Day", "desc": "The rookies are put to the test as they revisit past cases to ensure justice is served, leading to unexpected outcomes." },
        { "epno": 14, "title": "Casualties", "desc": "Nolan and Harper investigate a shooting at a high-profile event while Lopez deals with a betrayal within the department." },
        { "epno": 15, "title": "Hand-Off", "desc": "Nolan learns the value of teamwork when a hand-off operation goes awry, and Harper steps in to save the day." },
        { "epno": 16, "title": "The Overnight", "desc": "During a long night shift, the rookies face a series of interconnected cases that push their skills and stamina to the limit." },
        { "epno": 17, "title": "Control", "desc": "Nolan and Harper track a suspect who tests their ability to maintain control under pressure, while the rookies prepare for final evaluations." },
        { "epno": 18, "title": "Under the Gun", "desc": "The team responds to a series of bomb threats across the city, leading to a dramatic showdown." },
        { "epno": 19, "title": "The Q Word", "desc": "With their training nearly complete, the rookies face increased scrutiny as they navigate complex cases, leaving them questioning their future." },
        { "epno": 20, "title": "The Hunt", "desc": "The rookies’ final evaluations are interrupted by a manhunt for a dangerous fugitive, testing their courage and resolve like never before." }
    ]
    },
    {
        "name": "Season Three",
        "desc": "As a consequence of the investigation he and his new training officer, Nyla Harper, undertook without official sanction at the end of season two, Nolan does not exit the FTO program with Jackson West and Lucy Chen, but has to continue in the program for an additional month.",
        "poster": "https://static1.srcdn.com/wordpress/wp-content/uploads/trailers/episode_poster/185643_Season%203.jpg",
        "location": "seasons/three",
        "cast": "Nathan Fillion, Alyssa Diaz, Richard T. Jones, Titus Makin, Melissa O'Neil, Mekia Cox, Eric Winter, Shawn Ashmore",
        "episodes": [
        { "epno": 1, "title": "Consequences", "desc": "Officer Nolan faces the fallout of his actions in the previous season finale as he tries to clear his name and regain the trust of his colleagues." },
        { "epno": 2, "title": "In Justice", "desc": "The team investigates a case involving a wrongfully accused suspect, sparking a heated debate about justice and accountability." },
        { "epno": 3, "title": "La Fiera", "desc": "Nolan and Harper encounter a dangerous criminal mastermind, La Fiera, during a routine investigation that turns deadly." },
        { "epno": 4, "title": "Sabotage", "desc": "An internal investigation shakes the department as someone close to the team is suspected of sabotage, leaving Nolan in a difficult position." },
        { "epno": 5, "title": "Lockdown", "desc": "The precinct goes into lockdown after a violent escape attempt by prisoners, forcing the officers to act quickly to protect everyone inside." },
        { "epno": 6, "title": "Revelations", "desc": "Secrets from Harper’s undercover past come to light, impacting her partnership with Nolan and their latest case." },
        { "epno": 7, "title": "True Crime", "desc": "The team participates in a documentary about a high-profile murder case, but tensions rise as the cameras capture more than expected." },
        { "epno": 8, "title": "Bad Blood", "desc": "Nolan works to resolve a family dispute that escalates into a violent conflict, testing his ability to de-escalate tense situations." },
        { "epno": 9, "title": "Amber", "desc": "The team races against time to locate a missing child in an Amber Alert case, bringing everyone’s emotions to the surface." },
        { "epno": 10, "title": "Man of Honor", "desc": "Nolan assists a former police officer seeking redemption while grappling with his own struggles as a new officer." },
        { "epno": 11, "title": "New Blood", "desc": "A new officer joins the precinct, challenging the dynamic of the team and forcing everyone to reevaluate their roles." },
        { "epno": 12, "title": "Brave Heart", "desc": "Nolan and Harper help a young man caught between gang violence and his dreams of a better future." },
        { "epno": 13, "title": "Triple Duty", "desc": "A series of interconnected cases keep the team on their toes, testing their stamina and ability to adapt under pressure." },
        { "epno": 14, "title": "Threshold", "desc": "The officers navigate a standoff involving a desperate suspect with nothing to lose, leading to life-changing decisions for Nolan." }
    ]
    },
    {
        "name": "Season Four",
        "desc": "The fourth season picks up where the last season ended with a pregnant Angela Lopez being taken to Guatemala to be held hostage by La Fiera until the former gives birth, after which La Fiera plans to kill Angela and keep the baby. Sergeant Grey and a team of LAPD take on the dual tasks of finding and rescuing Angela and apprehending a man who killed Jackson West during the kidnapping. As the season progresses, Wesley Evers confronts the consequences of a deal he made with a crime boss, Nolan finally exits the FTO and starts a relationship with Bailey Nune, and Nyla Harper takes on a new rookie, Aaron Thorsen.",
        "poster": "https://static1.srcdn.com/wordpress/wp-content/uploads/trailers/episode_poster/185643_Season%204.jpg",
        "cast": "Nathan Fillion, Alyssa Diaz, Richard T. Jones, Jenna Dewan, Melissa O'Neil, Mekia Cox, Eric Winter, Shawn Ashmore",
        "location": "seasons/four",
        "episodes": [
        { "epno": 1, "title": "Life and Death", "desc": "Officer Nolan and the entire team race against the clock to locate Lopez after she is kidnapped on her wedding day, not only to save her life but her unborn child's." },
        { "epno": 2, "title": "Five Minutes", "desc": "Officer Nolan and Officer Chen's run-in with an infamous thief tips them off to a potentially big heist surrounding the Getty's big gala event. Meanwhile, Nolan works up the courage to ask Bailey out on date." },
        { "epno": 3, "title": "In the Line of Fire", "desc": "Officer Nolan and Chen report to a structure fire and suspect that there is more to the situation than meets the eye. Meanwhile, after witnessing a sniper shooting, the team searches for the shooter." },
        { "epno": 4, "title": "Red Hot", "desc": "Officer Nolan and Officer Chen search for a missing person who may have international ties that puts everyone's lives in danger; Harper continues the search for a serial arsonist; Wesley must overcome an impossible task." },
        { "epno": 5, "title": "A.C.H.", "desc": "When a new designer drug hits LA streets, it turns users into 'zombies,' and Officer Nolan and the team have a Halloween they won't soon forget. Back at home, Lucy questions whether her apartment building might be haunted." },
        { "epno": 6, "title": "Poetic Justice", "desc": "Officer Nolan and team are on a hunt to retrieve a buried stash of gold before any treasure seekers get hurt. Meanwhile, Bradford is tasked with encouraging the oldest cop at the station to retire and invites him to ride with him." },
        { "epno": 7, "title": "Fire Fight", "desc": "Officer Chen and Officer Bradford demand a treasure hunt rematch and enlist Officer Grey to help set the terms to a new bet, all while they arrest a series of wealthy female criminals." },
        { "epno": 8, "title": "Hit and Run", "desc": "The squad encounters a sovereign citizen and deals with a domestic terrorist plot. Angela and Wesley argue about their predicament." },
        { "epno": 9, "title": "Breakdown", "desc": "Wesley finally manages to break free of his dirty contract. Nolan deals with an increasingly serious relationship and underhanded election techniques. Bradford learns some unpleasant things about his parents." },
        { "epno": 10, "title": "Heart Beat", "desc": "Now that John Nolan knows about Bailey's past, he must decide if they still have a future; when a plane crashes in the middle of the city, the team races to find out why." },
        { "epno": 11, "title": "End Game", "desc": "The team must rely on a criminal for his expertise to take down a bigger threat. Officers Chen and Bradford investigate a murder of a homeless teenager." },
        { "epno": 12, "title": "The Knock", "desc": "The team responds to the report of a severed hand that has washed up on the beach. Tim attempts to prove his isn't a control freak to Lucy and invites her on a double date." },
        { "epno": 13, "title": "Fight or Flight", "desc": "John Nolan and Lucy Chen must fulfill three quests if they want to get a stolen police helicopter back safely from a teenage thief; Nyla Harper and Aaron Thorson must guard a convicted cop killer in the hospital following a prison riot." },
        { "epno": 14, "title": "Long Shot", "desc": "Nolan and Harper help Skip Tracer Randy complete his first bounty. Officer Chen and Sergeant Bradford hunt for a perpetrator on a citywide crime spree." },
        { "epno": 15, "title": "Hit List", "desc": "Harper puts Thorsen through 'Plain Clothes Day,' but the exercise is interrupted by an unexpected visitor. Meanwhile, two witnesses for an upcoming grand jury case are murdered, and Sgt. Grey might be next on the list." },
        { "epno": 16, "title": "Real Crime", "desc": "Thorsen's documentary crew does another update with the squad." },
        { "epno": 17, "title": "Coding", "desc": "Officer John Nolan and the team feel they must negotiate with a distraught man who is holding a hospital hostage to ensure his wife receives a lifesaving surgery." },
        { "epno": 18, "title": "Backstabbers", "desc": "Robbery of a train filled with valuable auction items turns deadly, the team is called to investigate." },
        { "epno": 19, "title": "Simone", "desc": "Officer Nolan and the LA division of the FBI enlist the help of FBI trainee Simone Clark when one of her former students is suspected of terrorism following an explosion at a local power station." },
        { "epno": 20, "title": "Enervo", "desc": "The team, alongside the LA division of the FBI, is in a race to stop truck bombs. The joint task force is suspicious of the CIA's involvement." },
        { "epno": 21, "title": "Mother's Day", "desc": "Sgt. Grey supports Officer Nolan to become a training officer and rides with him to help him prepare for the exam. Tim and Lucy decide on their plans for Mother's day and a romantic vacation." },
        { "epno": 22, "title": "Day in the Hole", "desc": "Officer Nolan is forced to spend a week in solitary confinement in a quiet border town with a young local officer who is in need of some training; Sgt. Bradford and Officer Chen go under cover together in a possible drug trafficking case." }
    ]
    },
    {
        "name": "Season Five",
        "desc": "In season 5, John Nolan is the recipient of a 'golden ticket' due to his heroic actions in the season 4 finale, and as a result he fulfills his goal of becoming a training officer. His first rookie, Celina Juarez, presents some challenges to Nolan's methods of training, but they eventually bond in spite of those challenges. Nyla Harper and her husband James Murray move into a new house, and Harper gives birth to their daughter Leah, while Angela Lopez finds herself pregnant again. Bradford and Chen finally come together both as a couple and as fellow officers, as Tim transfers to the LAPD Metro Division. Wesley Evers deals with the fallout from his involvement with Elijah Stone, who ends up incarcerated.",
        "poster": "https://static1.srcdn.com/wordpress/wp-content/uploads/trailers/episode_poster/185643_Season%205.jpg",
        "location": "seasons/five",
        "cast": "Nathan Fillion, Alyssa Diaz, Richard T. Jones, Jenna Dewan, Melissa O'Neil, Mekia Cox, Eric Winter, Shawn Ashmore, Tru Valentino",
        "episodes": [
        { "epno": 1, "title": "Double Down", "desc": "Nolan faces serial killer Rosalind Dyer again while Bradford and Chen work undercover to arrest criminals." },
        { "epno": 2, "title": "Labor Day", "desc": "Nolan's new role as a training officer advances, and Lucy earns an invitation for special training." },
        { "epno": 3, "title": "Dye Hard", "desc": "Nolan's rookie, Celina, presents challenges, but they start working together." },
        { "epno": 4, "title": "The Choice", "desc": "Rosalind returns, and Bailey's life is at risk as the LAPD and FBI collaborate." },
        { "epno": 5, "title": "The Fugitive", "desc": "Nolan and Celina track down a fugitive, while Lucy helps Tim with a personal issue." },
        { "epno": 6, "title": "The Reckoning", "desc": "Nolan and Celina investigate a case tied to a former DEA case; Wesley faces trouble from Elijah's lawyer." },
        { "epno": 7, "title": "Crossfire", "desc": "Nolan and Celina witness a shooting, while Bailey struggles with recent changes." },
        { "epno": 8, "title": "The Collar", "desc": "Nolan and Celina race against time to stop an explosive threat." },
        { "epno": 9, "title": "Take Back", "desc": "The team investigates the death of a suspect in custody while Grey and his wife face a personal crisis." },
        { "epno": 10, "title": "The List", "desc": "Nyla and James are caught in a bank robbery, while Tim and Lucy have complications on their first date." },
        { "epno": 11, "title": "The Naked and the Dead", "desc": "The team deals with a gang war while Lucy investigates a domestic abuse case." },
        { "epno": 12, "title": "Death Notice", "desc": "Nolan and Celina guard a prisoner; Lopez, Harper, and Aaron investigate a string of robberies." },
        { "epno": 13, "title": "Daddy Cop", "desc": "Nolan and Aaron follow leads after discovering criminals hiding at the station during a heatwave." },
        { "epno": 14, "title": "Death Sentence", "desc": "Nolan and Bailey search for a gunman, while Wesley suspects judicial corruption." },
        { "epno": 15, "title": "The Con", "desc": "Lopez helps Elijah Stone take down a gang leader in exchange for safety." },
        { "epno": 16, "title": "Exposed", "desc": "The team faces a militia with a dangerous weapon while dealing with a health crisis involving Ebola." },
        { "epno": 17, "title": "The Enemy Within", "desc": "The team investigates Elijah's plans and reopens Celina's sister's case." },
        { "epno": 18, "title": "Double Trouble", "desc": "Tim and Lucy search for a missing Dim, enlisting help from the CIA." },
        { "epno": 19, "title": "A Hole in the World", "desc": "The team investigates kidnappings that strike close to home for one of their own." },
        { "epno": 20, "title": "S.T.R.", "desc": "Tim's ex-wife asks the team for help; Tim and Lucy's relationship faces new pressures." },
        { "epno": 21, "title": "Going Under", "desc": "Chen goes undercover to infiltrate an illegal arms operation while Nolan and Harper solve a mystery." },
        { "epno": 22, "title": "Under Siege", "desc": "The team faces a series of close calls and realizes they may be targeted by masked assailants." }
    ]
    },
    {
        "name": "Season Six",
        "desc": "After the attack on Mid-Wilshire personnel in the final episode of season 5, it turns out to have been a diversion to enable a massive robbery at the Federal Reserve Bank. The only person captured in connection with the robbery is killed by an unknown sniper, who seems to be advised by attorney Monica Stevens. John Nolan and Bailey Nune get married, but their honeymoon on a remote island is interrupted by their discovery of a dead body that washes up on the shore. In a later episode, they discuss whether to have a baby despite their previous resolve not to have children.",
        "poster": "https://static1.srcdn.com/wordpress/wp-content/uploads/trailers/episode_poster/185643_Season%206.jpg",
        "location": "seasons/six",
        "cast": "Nathan Fillion, Alyssa Diaz, Richard T. Jones, Jenna Dewan, Melissa O'Neil, Mekia Cox, Eric Winter, Shawn Ashmore, Tru Valentino, Lesseth Chavez",
        "episodes": [
        { "epno": 1, "title": "Strike Back", "desc": "In the aftermath of the assaults, the team must now try to understand why they were targeted and if there is a bigger plan in place." },
        { "epno": 2, "title": "The Hammer", "desc": "The team comes together to celebrate John and Bailey's wedding; meanwhile, Celina discovers a discrepancy in her case, leading to a new discovery. Elsewhere, Lucy and Tim's relationship is put to the test." },
        { "epno": 3, "title": "Trouble in Paradise", "desc": "Nolan and Bailey's honeymoon is more of a nightmare than a dream when it turns into an active crime scene; Tim and Celina partner up and must uncover the identity of a John Doe." },
        { "epno": 4, "title": "Training Day", "desc": "It's Thorsen's first day back since the assault, and he's tasked with a series of high-stress cases to determine whether he's ready to work. Elsewhere, the team investigates a homicide case with a potential tie to the pentagram killer." },
        { "epno": 5, "title": "The Vow", "desc": "When a toddler is found at the scene of a crime, John and Bailey must decide what to do with it. Meanwhile, when someone from his past returns, Tim disappears and leaves Lucy in the dark." },
        { "epno": 6, "title": "Secrets and Lies", "desc": "After fostering, Bailey pushes for a baby while John and Celina hunt a vengeful escapee." },
        { "epno": 7, "title": "Crushed", "desc": "When two teenagers go missing, it is up to the entire team to find the girls and uncover the truth about their disappearance. Meanwhile, Lopez and Harper are on a different kind of investigation - the search for the perfect nanny." },
        { "epno": 8, "title": "Punch Card", "desc": "After a mafia-related mass casualty, the team is tasked to keep the peace at the hospital; Lucy and Celina work together to investigate the suspects behind the attack; Tim and Aaron embark on a metro ops mission." },
        { "epno": 9, "title": "The Squeeze", "desc": "Officer Nolan and Celina take on a special case. Monica enlists help to identify her attackers. Lopez and Harper discover a connection to the trail of crimes." },
        { "epno": 10, "title": "Escape Plan", "desc": "Sgt. Grey helps the team prepare for their biggest mission yet. Aaron, Lopez, Celina, Tim and Smitty discover a surprising connection in their case." }
    ]
    }
]